from unittest import TestCase
import os
import sys
sys.path.append(os.path.join(os.path.dirname(__file__), '..'))
from module.SudokuPuzzle import SudokuPuzzle

class TestSudokuPuzzle(TestCase):

    def test_puzzle1(self):
        """初級問題のテスト"""
        puzzle = [
            [0,5,9,0,3,0,7,2,0],
            [1,0,7,0,4,0,3,0,8],
            [0,6,0,2,0,5,0,4,0],
            [3,0,2,1,0,8,5,0,7],
            [0,1,0,7,0,6,0,3,0],
            [5,0,0,0,0,0,0,0,9],
            [0,0,4,0,0,0,6,0,0],
            [0,3,0,0,1,0,0,7,0],
            [7,0,1,5,6,4,2,0,3]
        ]
        answer = [
            [4,5,9,8,3,1,7,2,6],
            [1,2,7,6,4,9,3,5,8],
            [8,6,3,2,7,5,9,4,1],
            [3,4,2,1,9,8,5,6,7],
            [9,1,8,7,5,6,4,3,2],
            [5,7,6,4,2,3,1,8,9],
            [2,9,4,3,8,7,6,1,5],
            [6,3,5,9,1,2,8,7,4],
            [7,8,1,5,6,4,2,9,3]
        ]
        puzzleObj = SudokuPuzzle(puzzle)
        puzzleObj.solveTheEnd()
        self.assertEqual(puzzleObj.puzzle, answer)

    def test_puzzle2(self):
        """中級問題のテスト"""
        puzzle = [
            [8,0,0,0,0,0,0,0,3],
            [0,0,0,0,4,0,0,0,0],
            [5,0,0,1,9,6,0,0,7],
            [9,0,6,2,0,4,3,0,1],
            [0,7,0,0,0,0,0,6,0],
            [1,0,8,3,0,7,9,0,4],
            [3,0,0,4,7,2,0,0,9],
            [0,0,0,0,5,0,0,0,0],
            [2,0,0,0,0,0,0,0,6]
        ]
        answer = [
            [8,1,4,7,2,5,6,9,3],
            [6,9,7,8,4,3,1,2,5],
            [5,3,2,1,9,6,8,4,7],
            [9,5,6,2,8,4,3,7,1],
            [4,7,3,5,1,9,2,6,8],
            [1,2,8,3,6,7,9,5,4],
            [3,6,1,4,7,2,5,8,9],
            [7,8,9,6,5,1,4,3,2],
            [2,4,5,9,3,8,7,1,6]
        ]
        puzzleObj = SudokuPuzzle(puzzle)
        puzzleObj.solveTheEnd()
        self.assertEqual(puzzleObj.puzzle, answer)

    def test_puzzle3(self):
        """上級問題のテスト"""
        puzzle = [
            [3,0,6,0,0,0,4,0,5],
            [0,0,0,0,8,0,0,0,0],
            [0,0,0,6,0,2,0,0,0],
            [1,4,2,0,0,0,9,8,3],
            [0,0,7,4,0,1,2,0,0],
            [6,5,9,0,0,0,1,4,7],
            [0,0,0,9,0,7,0,0,0],
            [0,0,0,0,1,0,0,0,0],
            [2,0,5,0,0,0,7,0,8]
        ]
        answer = [
            [3,8,6,1,7,9,4,2,5],
            [7,2,1,5,8,4,6,3,9],
            [5,9,4,6,3,2,8,7,1],
            [1,4,2,7,6,5,9,8,3],
            [8,3,7,4,9,1,2,5,6],
            [6,5,9,8,2,3,1,4,7],
            [4,6,8,9,5,7,3,1,2],
            [9,7,3,2,1,8,5,6,4],
            [2,1,5,3,4,6,7,9,8]
        ]
        puzzleObj = SudokuPuzzle(puzzle)
        puzzleObj.solveTheEnd()
        self.assertEqual(puzzleObj.puzzle, answer)

if __name__ == "__main__":
    unittest.main()